Диплом/src/Documents/ПеремещениеТоваровМатериалов/ПеремещениеТоваровМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваровМатериалов</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериаловИТоваров</registerRecords>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеМатериала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериалыДляПеремещения</name>
    <attributes>
      <name>Номенклатура_Материалов</name>
      <type>
        <types>CatalogRef.РасходникиДляПроизводства_Номенклатура</types>
        <types>CatalogRef.ЛесСырьё_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМатериалов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницаИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыДляПеремещения</name>
    <attributes>
      <name>Номенклатура_Товаров</name>
      <type>
        <types>CatalogRef.ДеревянныеЩиты_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницаИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/Catalogs/Помещения/Помещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Помещения</name>
  <comment>Помещения</comment>
  <predefined>
    <items>
      <name>Производство</name>
      <description>Производство</description>
    </items>
    <items>
      <name>СкладСырья</name>
      <description>Склад сырья (лес)</description>
    </items>
    <items>
      <name>СкладЩитов</name>
      <description>Склад щитов</description>
    </items>
  </predefined>
</mdclass:Catalog>

Диплом/src/Documents/ПеремещениеТоваровМатериалов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПеремещениеТовараПриИзменении(Элемент)
	Если Объект.ПеремещениеТовара = Истина Тогда
		Элементы.ПеремещениеМатериала.Видимость=Ложь;
		Элементы.ТоварыДляПеремещения.Видимость = Истина;
	Иначе
		Элементы.ТоварыДляПеремещения.Видимость = Ложь;
		Элементы.ПеремещениеМатериала.Видимость=Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеМатериалаПриИзменении(Элемент)
	Если Объект.ПеремещениеМатериала = Истина Тогда
		Элементы.ПеремещениеТовара.Видимость=Ложь;
		Элементы.МатериалыДляПеремещения.Видимость = Истина;
	Иначе
		Элементы.МатериалыДляПеремещения.Видимость = Ложь;
		Элементы.ПеремещениеТовара.Видимость=Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОтправительПриИзменении(Элемент)	
	Если Объект.Отправитель = ПредопределенноеЗначение("Справочник.Помещения.Производство") Тогда
        Объект.Получатель = ПредопределенноеЗначение("Справочник.Помещения.СкладЩитов");
	КонецЕсли;	
	Если Объект.Отправитель = ПредопределенноеЗначение("Справочник.Помещения.СкладСырья") Тогда
        Объект.Получатель = ПредопределенноеЗначение("Справочник.Помещения.Производство");
	КонецЕсли;
КонецПроцедуры
